[
 {
  "courseName": "Projet de master en science et ingénierie computationelles",
  "courseCode": "MATH-598",
  "courseSection": "MA",
  "profName": [
   "Profs divers"
  ],
  "courseCredit": "30"
 },
 {
  "courseName": "CSE project I",
  "courseCode": "MATH-591",
  "courseSection": "MA",
  "profName": [
   "Profs divers"
  ],
  "courseCredit": "8"
 },
 {
  "courseName": "CSE project II",
  "courseCode": "MATH-592",
  "courseSection": "MA",
  "profName": [
   "Profs divers"
  ],
  "courseCredit": "8"
 },
 {
  "courseName": "Engineering internship (master in computational sciences and engineering",
  "courseCode": "MATH-595",
  "courseSection": "MA",
  "profName": [
   "Profs divers"
  ],
  "courseCredit": "8"
 },
 {
  "courseName": "HSS : Introduction to project",
  "courseCode": "",
  "courseSection": "SHS",
  "profName": [
   "Divers enseignants"
  ],
  "courseCredit": "3"
 },
 {
  "courseName": "HSS : Project",
  "courseCode": "",
  "courseSection": "SHS",
  "profName": [
   "Divers enseignants"
  ],
  "courseCredit": "3"
 },
 {
  "courseName": "Advanced numerical analysis",
  "courseCode": "MATH-351",
  "courseSection": "MA",
  "profName": [
   "Picasso"
  ],
  "courseCredit": "5",
  "courseDesc": "The student will learn state-of-the-art algorithms for solving ordinary differential equations, nonlinear systems, and optimization problems. The analysis and implementation of these algorithms will be discussed in some detail."
 },
 {
  "courseName": "Algorithms",
  "courseCode": "CS-250",
  "courseSection": "IN",
  "profName": [
   "Kapralov"
  ],
  "courseCredit": "6",
  "courseDesc": "The students learn the theory and practice of basic concepts and techniques in algorithms. The course covers mathematical induction, techniques for analyzing algorithms, elementary data structures, major algorithmic paradigms such as dynamic programming, sorting and searching, and graph algorithms."
 },
 {
  "courseName": "Computational physics III",
  "courseCode": "PHYS-332",
  "courseSection": "PH",
  "profName": [
   "Yazyev"
  ],
  "courseCredit": "3",
  "courseDesc": "This course teaches the students practical skills needed for solving modern physics problems by means of computation. A number of examples illustrate the utility of numerical computations in various domains of physics."
 },
 {
  "courseName": "Computer simulation of physical systems I",
  "courseCode": "PHYS-403",
  "courseSection": "PH",
  "profName": [
   "Pasquarello"
  ],
  "courseCredit": "4",
  "courseDesc": "The two main topics covered by this course are classical molecular dynamics and the Monte Carlo method."
 },
 {
  "courseName": "Image processing I",
  "courseCode": "MICRO-511",
  "courseSection": "MT",
  "profName": [
   "Unser",
   "Van De Ville"
  ],
  "courseCredit": "3",
  "courseDesc": "Introduction to the basic techniques of image processing. Introduction to the development of image-processing software and to prototyping in JAVA. Application to real-world examples in industrial vision and biomedical imaging."
 },
 {
  "courseName": "Molecular dynamics and Monte-Carlo simulations",
  "courseCode": "CH-351",
  "courseSection": "CGC",
  "profName": [
   "Röthlisberger"
  ],
  "courseCredit": "2",
  "courseDesc": ""
 },
 {
  "courseName": "Numerical analysis and computational mathematics",
  "courseCode": "MATH-456",
  "courseSection": "MA",
  "profName": [
   "Vazquez Hernandez"
  ],
  "courseCredit": "4",
  "courseDesc": "The course provides an introduction to scientific computing. Several numerical methods are presented for the computer solution of mathematical problems arising in different applications. The software MATLAB is used to solve the problems and verify the theoretical properties of the numerical methods."
 },
 {
  "courseName": "Numerical integration of dynamical systems",
  "courseCode": "MATH-452",
  "courseSection": "MA",
  "profName": [
   ""
  ],
  "courseCredit": "5",
  "courseDesc": "In this course we will introduce and study numerical integrators for multi-scale (or stiff) differential equations and dynamical systems with special geometric structures (symplecticity, reversibility, first integrals, etc.). These numerical methods are important for many applications."
 },
 {
  "courseName": "Parallel and high-performance computing",
  "courseCode": "MATH-454",
  "courseSection": "MA",
  "profName": [
   "Richart"
  ],
  "courseCredit": "4",
  "courseDesc": "This course provides insight into a broad variety of High Performance Computing (HPC) concepts and the majority of modern HPC architectures. Moreover, the student will learn to have a feeling about what architectures are suited for several types of algorithms."
 },
 {
  "courseName": "Programming concepts in scientific computing",
  "courseCode": "MATH-458",
  "courseSection": "GC",
  "profName": [
   "Anciaux"
  ],
  "courseCredit": "4",
  "courseDesc": "The aim of this course is to provide the background in scientific computing. The class includes a brief introduction to basic programming in c++, it then focus on object oriented programming and c++ specific programming techniques."
 },
 {
  "courseName": "Software engineering",
  "courseCode": "CS-305",
  "courseSection": "IN",
  "profName": [
   "Candea"
  ],
  "courseCredit": "4",
  "courseDesc": "This course teaches the basics of modern software development, focusing on techniques and practices used to build computer software that meets high standards of quality, reliability, security, and maintainability."
 },
 {
  "courseName": "Advanced algorithms",
  "courseCode": "CS-450",
  "courseSection": "IN",
  "profName": [
   "Kapralov"
  ],
  "courseCredit": "7",
  "courseDesc": "A first graduate course in algorithms, this course assumes minimal background, but moves rapidly. The objective is to learn the main techniques of algorithm analysis and design, while building a repertory of basic algorithmic solutions to problems in many domains."
 },
 {
  "courseName": "Advanced continuum mechanics",
  "courseCode": "CIVIL-422",
  "courseSection": "GC",
  "profName": [
   "Molinari"
  ],
  "courseCredit": "3",
  "courseDesc": "Reading class of classic text book of Lawrence Malvern \"Introduction to the Mechanics of a Continuous Medium\". A special emphasis will be put on advanced topics, including finite kinematics, and non-linear material behavior. Applications will cover both solids and structures fluid mechanics."
 },
 {
  "courseName": "Advanced multiprocessor architecture",
  "courseCode": "CS-471",
  "courseSection": "IN",
  "profName": [
   "Falsafi"
  ],
  "courseCredit": "6",
  "courseDesc": "Multiprocessors are now the defacto building blocks for all computer systems. This course will build upon the basic concepts offered in Computer Architecture I to cover the architecture and organization of modern multiprocessors from mobile and embedded platforms to servers, data centers and cloud computing platforms."
 },
 {
  "courseName": "Applied data analysis",
  "courseCode": "CS-401",
  "courseSection": "SC",
  "profName": [
   "West"
  ],
  "courseCredit": "6",
  "courseDesc": "This course teaches the basic techniques and practical skills required to make sense out of a variety of data, with the help of the most acclaimed software tools in the data science world: pandas, scikit-learn, Spark, etc."
 },
 {
  "courseName": "Artificial neural networks",
  "courseCode": "CS-456",
  "courseSection": "IN",
  "profName": [
   "Gerstner"
  ],
  "courseCredit": "4",
  "courseDesc": "Since 2010 approaches in deep learning have revolutionized fields as diverse as computer vision, machine learning, or artificial intelligence. This course gives a systematic introduction into the main  models of deep artificial neural networks: Supervised Learning and Reinforcement Learning."
 },
 {
  "courseName": "Atomistic and quantum simulations of materials",
  "courseCode": "MSE-468",
  "courseSection": "MX",
  "profName": [
   "Marzari"
  ],
  "courseCredit": "4",
  "courseDesc": "Theory and application of quantum simulations to model, understand, and predict the properties of real materials."
 },
 {
  "courseName": "Biological modeling of neural networks",
  "courseCode": "BIO-465",
  "courseSection": "IN",
  "profName": [
   "Gerstner"
  ],
  "courseCredit": "4",
  "courseDesc": "In this course we study mathematical models of neurons and neuronal networks in the context of biology and establish links to models of cognition."
 },
 {
  "courseName": "Biomolecular structure and mechanics",
  "courseCode": "BIO-315",
  "courseSection": "SV",
  "profName": [
   "Dal Peraro"
  ],
  "courseCredit": "4",
  "courseDesc": "Main focus of this course is on the description and design of molecular interactions defining the structure, dynamics and function of biological systems. The principal experimental and computational techniques used in structural biology, molecular modeling and design will be introduced and practiced"
 },
 {
  "courseName": "Computational finance",
  "courseCode": "FIN-472",
  "courseSection": "IF",
  "profName": [
   "Glau",
   "Pulido Nino",
   "Statti"
  ],
  "courseCredit": "5",
  "courseDesc": "Participants of this course will master computational techniques frequently used in mathematical finance applications. Emphasis will be put on the implementation and practical aspects."
 },
 {
  "courseName": "Computational linear algebra",
  "courseCode": "MATH-453",
  "courseSection": "MA",
  "profName": [
   "Kressner"
  ],
  "courseCredit": "5",
  "courseDesc": "This course provides an overview of state-of-the-art techniques for solving large-scale linear algebra problems, as they typically arise in applications. A central goal of this course is to give the ability to choose a suitable solver for a given application."
 },
 {
  "courseName": "Computational methods in molecular quantum mechanics",
  "courseCode": "CH-452",
  "courseSection": "CGC",
  "profName": [
   "Bonella"
  ],
  "courseCredit": "4",
  "courseDesc": "This course will discuss the main methods for the simulation of quantum time dependent properties for molecular systems. Basic notions of density functional theory and of its time dependent version will be covered in the context of adiabatic and non adiabatic dynamics."
 },
 {
  "courseName": "Convex optimization and applications",
  "courseCode": "CS-454",
  "courseSection": "MTE",
  "profName": [
   ""
  ],
  "courseCredit": "4",
  "courseDesc": ""
 },
 {
  "courseName": "Deep learning",
  "courseCode": "EE-559",
  "courseSection": "EL",
  "profName": [
   "Fleuret"
  ],
  "courseCredit": "4",
  "courseDesc": "The objective of this course is to provide a complete introduction to deep machine learning. How to design a neural network, how to train it, and what are the modern techniques that specifically handle very large networks."
 },
 {
  "courseName": "Digital 3D geometry processing",
  "courseCode": "CS-446",
  "courseSection": "IN",
  "profName": [
   "Pauly"
  ],
  "courseCredit": "5",
  "courseDesc": "Students study & apply core concepts and algorithms for digital geometry processing. They create their own digital and physical geometry that follows the digital 3D content creation pipeline from data acquisition, geometry processing, to physical fabrication."
 },
 {
  "courseName": "Distributed intelligent systems",
  "courseCode": "ENG-466",
  "courseSection": "SIE",
  "profName": [
   "Martinoli"
  ],
  "courseCredit": "5",
  "courseDesc": "The goal of this course is to provide methods and tools for modeling distributed intelligent systems as well as designing and optimizing coordination strategies. The course is a well-balanced mixture of theory and practical activities using simulation and real hardware platforms."
 },
 {
  "courseName": "Dynamical system theory for engineers",
  "courseCode": "COM-502",
  "courseSection": "SC",
  "profName": [
   "Thiran"
  ],
  "courseCredit": "4",
  "courseDesc": "Linear and nonlinear dynamical systems are found in all fields of science and engineering. After a short review of linear system theory, the class will explain and develop the main tools for the qualitative analysis of nonlinear systems, both in discrete-time and continuous-time."
 },
 {
  "courseName": "Environmental transport phenomena",
  "courseCode": "ENG-420",
  "courseSection": "SIE",
  "profName": [
   "Crouzy",
   "Porté Agel"
  ],
  "courseCredit": "5",
  "courseDesc": "The course aims at introducing basic physical aspects of molecular and turbulent diffusion, as well as of dispersion processes, their mathematical modeling, solutions and related environmental applications"
 },
 {
  "courseName": "Hydrodynamics",
  "courseCode": "ME-444",
  "courseSection": "GM",
  "profName": [
   "Gallaire"
  ],
  "courseCredit": "5",
  "courseDesc": "Nondimensionalized Navier-Stokes equations result in a great variety of models (Stokes, Lubrification, Euler, Potential) depending on the Reynolds number. The concept of boundary layer enables us then to identify the different components of the hydrodynamic drag."
 },
 {
  "courseName": "Image processing II",
  "courseCode": "MICRO-512",
  "courseSection": "MT",
  "profName": [
   "Liebling",
   "Sage",
   "Unser",
   "Van De Ville"
  ],
  "courseCredit": "3",
  "courseDesc": "Study of advanced image processing; mathematical imaging. Development of image-processing software and prototyping in JAVA; application to real-world examples in industrial vision and biomedical imaging."
 },
 {
  "courseName": "Information security and privacy",
  "courseCode": "COM-402",
  "courseSection": "IN",
  "profName": [
   "González Troncoso",
   "Hubaux",
   "Oechslin"
  ],
  "courseCredit": "6",
  "courseDesc": "This course provides an overview of information security and privacy topics. It introduces students to the knowledge and tools they will need to deal with the security/privacy challenges they are likely to encounter in today's Big Data world. The tools are illustrated with relevant applications"
 },
 {
  "courseName": "Information theory and signal processing",
  "courseCode": "COM-406",
  "courseSection": "IN",
  "profName": [
   "Gastpar",
   "Telatar",
   "Urbanke"
  ],
  "courseCredit": "6",
  "courseDesc": "Information Theory and Signal Processing are key underpinnings of Data Science. They provide frameworks for signal representation and for fundamental performance bounds."
 },
 {
  "courseName": "Instability",
  "courseCode": "ME-466",
  "courseSection": "GM",
  "profName": [
   "Gallaire"
  ],
  "courseCredit": "3",
  "courseDesc": "This course focuses on the physical mechanisms at the origin of the transition of a flow from laminar to turbulent using the hydrodynamic instability theory."
 },
 {
  "courseName": "Introduction to electronic structure methods",
  "courseCode": "CH-353",
  "courseSection": "CGC",
  "profName": [
   "Röthlisberger"
  ],
  "courseCredit": "4",
  "courseDesc": "Repetition of the basic concepts of quantum mechanics and main numerical algorithms used for practical implementions. Basic principles of electronic structure methods:Hartree-Fock, many body perturbation theory, configuration interaction, coupled-cluster theory, density functional theory."
 },
 {
  "courseName": "Introduction to multiprocessor architecture",
  "courseCode": "CS-307",
  "courseSection": "IN",
  "profName": [
   "Jakob"
  ],
  "courseCredit": "3",
  "courseDesc": "Multiprocessors are a core component in all types of computing infrastructure, from phones to datacenters. This course will build on the prerequisites of processor design and concurrency to introduce the essential technologies required to combine multiple processing elements into a single computer."
 },
 {
  "courseName": "Low-rank approximation techniques",
  "courseCode": "MATH-403",
  "courseSection": "MA",
  "profName": [
   ""
  ],
  "courseCredit": "5",
  "courseDesc": "Low-rank approximation techniques have become a key tool in scientific computing to deal with large-scale problems and high-dimensional data. This course covers state-of-the-art algorithms and current research in this area."
 },
 {
  "courseName": "Machine learning",
  "courseCode": "CS-433",
  "courseSection": "IN",
  "profName": [
   "Jaggi",
   "Urbanke"
  ],
  "courseCredit": "7",
  "courseDesc": "Machine learning and data analysis are becoming increasingly central in many sciences and applications. In this course, fundamental principles and methods of machine learning will be introduced, analyzed and practically implemented."
 },
 {
  "courseName": "Mathematical foundations of signal processing",
  "courseCode": "COM-514",
  "courseSection": "SC",
  "profName": [
   "Kolundzija",
   "Parhizkar",
   "Scholefield"
  ],
  "courseCredit": "6",
  "courseDesc": "Signal processing tools are presented from an intuitive geometric point of view which is at the heart of all modern signal processing techniques. Student will develop the mathematical depth and rigor needed for the study of advanced topics in signal processing."
 },
 {
  "courseName": "Mathematical modelling of behavior",
  "courseCode": "MATH-463",
  "courseSection": "MA",
  "profName": [
   "Bierlaire"
  ],
  "courseCredit": "5",
  "courseDesc": "Discrete choice models allow for the analysis and prediction of individuals' choice behavior. The objective of the course is to introduce both methodological and applied aspects, in the field of marketing, transportation, and finance."
 },
 {
  "courseName": "Mathematical modelling of DNA",
  "courseCode": "MATH-481",
  "courseSection": "MA",
  "profName": [
   "Maddocks"
  ],
  "courseCredit": "5",
  "courseDesc": "Mathematical modelling of DNA"
 },
 {
  "courseName": "Mathematics of data: from theory to computation",
  "courseCode": "EE-556",
  "courseSection": "EL",
  "profName": [
   "Cevher"
  ],
  "courseCredit": "4",
  "courseDesc": "This course reviews recent advances in convex optimization and statistical analysis in the wake of Big Data. We provide an overview of the emerging convex formulations and their guarantees, describe scalable solution techniques, and illustrate the role of parallel and distributed computation."
 },
 {
  "courseName": "Molecular quantum dynamics",
  "courseCode": "CH-453",
  "courseSection": "CGC",
  "profName": [
   "Vanicek"
  ],
  "courseCredit": "3",
  "courseDesc": "The course covers several exact, approximate, and numerical methods to solve the time-dependent molecular Schrödinger equation, and applications including calculations of molecular electronic spectra. More advanced topics include introduction to the semiclassical methods and Feynman path integral."
 },
 {
  "courseName": "Numerical approximation of PDEs",
  "courseCode": "MATH-451",
  "courseSection": "MA",
  "profName": [
   "Dubuis"
  ],
  "courseCredit": "5",
  "courseDesc": "The course pertains to the derivation, theoretical analysis and implementation of finite difference and finite element methods for the numerical approximation of partial differential equations in one or more dimensions."
 },
 {
  "courseName": "Numerical flow simulation",
  "courseCode": "ME-474",
  "courseSection": "GM",
  "profName": [
   "Sawley"
  ],
  "courseCredit": "5",
  "courseDesc": "This course provides practical experience in the numerical simulation of fluid flows, comprising the three fundamental phases of pre-processing (geometry and mesh creation), computation (choice of physical models & numerical methods), and post-processing (quantitative analysis and visualization)."
 },
 {
  "courseName": "Numerical integration of stochastic differential equations",
  "courseCode": "MATH-450",
  "courseSection": "MA",
  "profName": [
   "Blumenthal"
  ],
  "courseCredit": "5",
  "courseDesc": "In this course we will introduce and study numerical integrators for stochastic differential equations. These numerical methods are important for many applications."
 },
 {
  "courseName": "Numerical methods for conservation laws",
  "courseCode": "MATH-459",
  "courseSection": "MA",
  "profName": [
   "Hesthaven"
  ],
  "courseCredit": "5",
  "courseDesc": "Introduction to the development, analysis, and application of computational methods for solving conservation laws with an emphasis on finite volume, limiter based schemes, high-order essentially non-oscillatory schemes, and discontinuous Galerkin methods."
 },
 {
  "courseName": "Numerical methods for saddle point problems",
  "courseCode": "MATH-468",
  "courseSection": "MA",
  "profName": [
   ""
  ],
  "courseCredit": "5",
  "courseDesc": "The aim of the course is to give a theoretical and practical knowledge of the finite element method for saddle point problems, such as fluid dynamics, elasticity and electromagnetic problems."
 },
 {
  "courseName": "Optimization for machine learning",
  "courseCode": "CS-439",
  "courseSection": "IN",
  "profName": [
   "Flammarion",
   "Jaggi"
  ],
  "courseCredit": "5",
  "courseDesc": "This course teaches an overview of modern optimization methods, for applications in machine learning and data science. In particular, scalability of algorithms to large datasets will be discussed in theory and in implementation."
 },
 {
  "courseName": "Particle-based methods",
  "courseCode": "ME-476",
  "courseSection": "GM",
  "profName": [
   "Sawley"
  ],
  "courseCredit": "4",
  "courseDesc": "This course provides an introduction to particle-based methods for the numerical resolution of partial differential equations describing continuum phenomena or for the simulation of particulate flows. Details are given for Smoothed Particle Hydrodynamics (SPH) and the Discrete Element Method (DEM)."
 },
 {
  "courseName": "Principles and applications of systems biology",
  "courseCode": "ChE-411",
  "courseSection": "CGC",
  "profName": [
   "Hatzimanikatis"
  ],
  "courseCredit": "3",
  "courseDesc": "C"
 },
 {
  "courseName": "Signal processing for communications",
  "courseCode": "COM-303",
  "courseSection": "SC",
  "profName": [
   "Prandoni"
  ],
  "courseCredit": "6",
  "courseDesc": "Students learn digital signal processing theory, including discrete time, Fourier analysis, filter design, adaptive filtering, sampling, interpolation and quantization; they are introduced to image processing and data communication system design."
 },
 {
  "courseName": "Statistics for data science",
  "courseCode": "MATH-413",
  "courseSection": "MA",
  "profName": [
   "Olhede"
  ],
  "courseCredit": "6",
  "courseDesc": "Statistics lies at the foundation of data science, providing a unifying theoretical and methodological backbone for the diverse tasks enountered in this emerging field. This course rigorously develops the key notions and methods of statistics, with an emphasis on concepts rather than techniques."
 },
 {
  "courseName": "Stochastic simulation",
  "courseCode": "MATH-414",
  "courseSection": "MA",
  "profName": [
   "Nobile"
  ],
  "courseCredit": "5",
  "courseDesc": "The student who follows this course will get acquainted with computational tools used to analyze systems with uncertainty arising in engineering, physics, chemistry, and economics. Focus will be on  sampling methods as Monte Carlo, quasi Monte Carlo,  Markov Chain Monte Carlo."
 },
 {
  "courseName": "Systems for data science",
  "courseCode": "CS-449",
  "courseSection": "IN",
  "profName": [
   "Koch"
  ],
  "courseCredit": "6",
  "courseDesc": "The course covers fundamental principles for understanding and building systems for managing and analyzing large amounts of data."
 },
 {
  "courseName": "Turbulence",
  "courseCode": "ME-467",
  "courseSection": "GM",
  "profName": [
   "Schneider"
  ],
  "courseCredit": "4",
  "courseDesc": "This course provides an introduction to the physical phenomenon of turbulence, its probabilistic description and modeling approaches including RANS and LES. Students are equipped with the basic knowledge to tackle complex flow problems in science and engineering practice."
 },
 {
  "courseName": "Understanding advanced molecular simulation",
  "courseCode": "CH-420",
  "courseSection": "CGC",
  "profName": [
   "Smit"
  ],
  "courseCredit": "4",
  "courseDesc": "This course introduces advanced molecular simulation techniques such as Monte Carlo and Molecular dynamics in different ensembles, free energy calculations, rare events, Configurational-bias Monte Carlo etc."
 },
 {
  "courseName": "Water quality modeling",
  "courseCode": "ENG-400",
  "courseSection": "SIE",
  "profName": [
   ""
  ],
  "courseCredit": "4",
  "courseDesc": "This course builds on environmental chemistry and microbiology taken in previous courses. The emphasis is on quantification using the public domain package, PHREEQC, which is an excellent computation tool. Numerous applications are investigated during the course."
 }
]