[
 {
  "courseName": "Engineering internship credited with Master project (master in Data sciences)",
  "courseCode": "COM-596",
  "courseSection": "SC",
  "profName": [
   "Profs divers"
  ]
 },
 {
  "courseName": "Master project in Data science",
  "courseCode": "COM-598",
  "courseSection": "SC",
  "profName": [
   "Profs divers"
  ]
 },
 {
  "courseName": "Advanced algorithms",
  "courseCode": "CS-450",
  "courseSection": "IN",
  "profName": [
   "Kapralov"
  ],
  "courseDesc": "A first graduate course in algorithms, this course assumes minimal background, but moves rapidly. The objective is to learn the main techniques of algorithm analysis and design, while building a repertory of basic algorithmic solutions to problems in many domains."
 },
 {
  "courseName": "Applied data analysis",
  "courseCode": "CS-401",
  "courseSection": "SC",
  "profName": [
   "West"
  ],
  "courseDesc": "This course teaches the basic techniques and practical skills required to make sense out of a variety of data, with the help of the most acclaimed software tools in the data science world: pandas, scikit-learn, Spark, etc."
 },
 {
  "courseName": "Information security and privacy",
  "courseCode": "COM-402",
  "courseSection": "IN",
  "profName": [
   "González Troncoso",
   "Hubaux",
   "Oechslin"
  ],
  "courseDesc": "This course provides an overview of information security and privacy topics. It introduces students to the knowledge and tools they will need to deal with the security/privacy challenges they are likely to encounter in today's Big Data world. The tools are illustrated with relevant applications"
 },
 {
  "courseName": "Information theory and signal processing",
  "courseCode": "COM-406",
  "courseSection": "IN",
  "profName": [
   "Gastpar",
   "Telatar",
   "Urbanke"
  ],
  "courseDesc": "Information Theory and Signal Processing are key underpinnings of Data Science. They provide frameworks for signal representation and for fundamental performance bounds."
 },
 {
  "courseName": "Machine learning",
  "courseCode": "CS-433",
  "courseSection": "IN",
  "profName": [
   "Jaggi",
   "Urbanke"
  ],
  "courseDesc": "Machine learning and data analysis are becoming increasingly central in many sciences and applications. In this course, fundamental principles and methods of machine learning will be introduced, analyzed and practically implemented."
 },
 {
  "courseName": "Optimization for machine learning",
  "courseCode": "CS-439",
  "courseSection": "IN",
  "profName": [
   "Flammarion",
   "Jaggi"
  ],
  "courseDesc": "This course teaches an overview of modern optimization methods, for applications in machine learning and data science. In particular, scalability of algorithms to large datasets will be discussed in theory and in implementation."
 },
 {
  "courseName": "Statistics for data science",
  "courseCode": "MATH-413",
  "courseSection": "MA",
  "profName": [
   "Olhede"
  ],
  "courseDesc": "Statistics lies at the foundation of data science, providing a unifying theoretical and methodological backbone for the diverse tasks enountered in this emerging field. This course rigorously develops the key notions and methods of statistics, with an emphasis on concepts rather than techniques."
 },
 {
  "courseName": "Systems for data science",
  "courseCode": "CS-449",
  "courseSection": "IN",
  "profName": [
   "Koch"
  ],
  "courseDesc": "The course covers fundamental principles for understanding and building systems for managing and analyzing large amounts of data."
 },
 {
  "courseName": "Advanced cryptography",
  "courseCode": "COM-501",
  "courseSection": "SC",
  "profName": [
   "Vaudenay"
  ],
  "courseDesc": "This course reviews some failure cases in public-key cryptography. It introduces some cryptanalysis techniques. It also presents fundamentals in cryptography such as interactive proofs. Finally, it presents some techniques to validate the security of cryptographic primitives."
 },
 {
  "courseName": "Advanced probability and applications",
  "courseCode": "COM-417",
  "courseSection": "SC",
  "profName": [
   "Lévêque"
  ],
  "courseDesc": "In this course, various aspects of probability theory are considered. The first part is devoted to the main theorems in the field (law of large numbers, central limit theorem, concentration inequalities), while the second part focuses on the theory of martingales in discrete time."
 },
 {
  "courseName": "Advanced topics on privacy enhancing technologies",
  "courseCode": "CS-523",
  "courseSection": "IN",
  "profName": [
   "González Troncoso",
   "Hubaux"
  ],
  "courseDesc": "This advanced course will provide students with the knowledge to tackle the design of privacy-preserving ICT systems.  Students will learn about existing technologies to protect privacy, and how to evaluate the protection they provide."
 },
 {
  "courseName": "A Network Tour of Data Science",
  "courseCode": "EE-558",
  "courseSection": "EL",
  "profName": [
   "Frossard",
   "Vandergheynst"
  ],
  "courseDesc": "A Network Tour of Data Science\nEE-558    Lecturer(s) : Frossard PascalVandergheynst PierreLanguage:English"
 },
 {
  "courseName": "Applied biostatistics",
  "courseCode": "MATH-493",
  "courseSection": "MA",
  "profName": [
   "Goldstein"
  ],
  "courseDesc": "This course covers topics in applied biostatistics, with an emphasis on practical aspects of data analysis using R statistical software. Topics include types of studies and their design and analysis, high dimensional data analysis (genetic/genomic) and other topics as time and interest permit."
 },
 {
  "courseName": "Artificial neural networks",
  "courseCode": "CS-456",
  "courseSection": "IN",
  "profName": [
   "Gerstner"
  ],
  "courseDesc": "Since 2010 approaches in deep learning have revolutionized fields as diverse as computer vision, machine learning, or artificial intelligence. This course gives a systematic introduction into the main  models of deep artificial neural networks: Supervised Learning and Reinforcement Learning."
 },
 {
  "courseName": "Audio and acoustic signal processing",
  "courseCode": "COM-415",
  "courseSection": "SC",
  "profName": [
   "Faller",
   "Kolundzija"
  ],
  "courseDesc": "The objective of the course is to introduce theory, methods, ans basic psychoacoustics that is needed to understand state-of-the-art techniques used in pro audio and consumer audio, including microphones, surround sound, mixing and audio coding."
 },
 {
  "courseName": "Automatic speech processing",
  "courseCode": "EE-554",
  "courseSection": "EL",
  "profName": [
   "Bourlard"
  ],
  "courseDesc": "The goal of this course is to provide the students with the main formalisms, models and algorithms required for the implementation of advanced speech processing applications (involving, among others, speech coding, speech analysis/synthesis, and speech recognition)."
 },
 {
  "courseName": "Biological modeling of neural networks",
  "courseCode": "BIO-465",
  "courseSection": "IN",
  "profName": [
   "Gerstner"
  ],
  "courseDesc": "In this course we study mathematical models of neurons and neuronal networks in the context of biology and establish links to models of cognition."
 },
 {
  "courseName": "Combinatorial optimization",
  "courseCode": "MATH-460",
  "courseSection": "MA",
  "profName": [
   ""
  ],
  "courseDesc": "The guiding question of Combinatorial Optimization is: How do I efficiently select an optimal solution among a finite but very large set of alternatives? We will address the solution of this question in the context of classical discrete optimization problems."
 },
 {
  "courseName": "Computational complexity",
  "courseCode": "CS-524",
  "courseSection": "IN",
  "profName": [
   ""
  ],
  "courseDesc": "In computational complexity we study the computational resources needed to solve problems and understand the relation between different types of computation. \n\nThis course advances the students knowledge of computational complexity, and develop an understanding of fundamental open questions."
 },
 {
  "courseName": "Computational linear algebra",
  "courseCode": "MATH-453",
  "courseSection": "MA",
  "profName": [
   "Kressner"
  ],
  "courseDesc": "This course provides an overview of state-of-the-art techniques for solving large-scale linear algebra problems, as they typically arise in applications. A central goal of this course is to give the ability to choose a suitable solver for a given application."
 },
 {
  "courseName": "Computational photography",
  "courseCode": "CS-413",
  "courseSection": "SC",
  "profName": [
   "Süsstrunk"
  ],
  "courseDesc": "The students will gain the theoretical knowledge in computational photography, which allows recording and processing a richer visual experience than traditional digital imaging. They will also execute practical group projects to develop their own computational photography application."
 },
 {
  "courseName": "Computer vision",
  "courseCode": "CS-442",
  "courseSection": "IN",
  "profName": [
   "Fua"
  ],
  "courseDesc": "Computer Vision aims at modeling the world from digital images acquired using video or infrared cameras, and other imaging sensors.\n\nWe will focus on images acquired using digital cameras. We will introduce basic processing techniques and discuss their field of applicability."
 },
 {
  "courseName": "Convex optimization and applications",
  "courseCode": "CS-454",
  "courseSection": "MTE",
  "profName": [
   ""
  ],
  "courseDesc": ""
 },
 {
  "courseName": "Cryptography and security",
  "courseCode": "COM-401",
  "courseSection": "SC",
  "profName": [
   "Vaudenay"
  ],
  "courseDesc": "This course introduces the basics of cryptography. We review several types of cryptographic primitives, when it is safe to use them and how to select the appropriate security parameters. We detail how they work and sketch how they can be implemented."
 },
 {
  "courseName": "Data visualization",
  "courseCode": "COM-480",
  "courseSection": "SC",
  "profName": [
   "Vuillon"
  ],
  "courseDesc": "Understanding why and how to present complex data interactively in an effective manner has become a crucial skill for any data scientist. In this course, you will learn how to design, judge, build and present your own interactive data visualizations."
 },
 {
  "courseName": "Deep learning",
  "courseCode": "EE-559",
  "courseSection": "EL",
  "profName": [
   "Fleuret"
  ],
  "courseDesc": "The objective of this course is to provide a complete introduction to deep machine learning. How to design a neural network, how to train it, and what are the modern techniques that specifically handle very large networks."
 },
 {
  "courseName": "Digital education & learning analytics",
  "courseCode": "CS-411",
  "courseSection": "IN",
  "profName": [
   "Dillenbourg",
   "Jermann"
  ],
  "courseDesc": "This course addresses the relationship between specific technological features and the learners' cognitive processes. It also covers the methods and results of empirical studies on this topic: do student actually learn due to technologies?"
 },
 {
  "courseName": "Distributed information systems",
  "courseCode": "CS-423",
  "courseSection": "SC",
  "profName": [
   "Aberer"
  ],
  "courseDesc": "This course introduces the key concepts and algorithms from the areas of information retrieval, data mining and knowledge bases, which constitute the foundations of today's Web-based distributed information systems."
 },
 {
  "courseName": "Distributed intelligent systems",
  "courseCode": "ENG-466",
  "courseSection": "SIE",
  "profName": [
   "Martinoli"
  ],
  "courseDesc": "The goal of this course is to provide methods and tools for modeling distributed intelligent systems as well as designing and optimizing coordination strategies. The course is a well-balanced mixture of theory and practical activities using simulation and real hardware platforms."
 },
 {
  "courseName": "Formal verification",
  "courseCode": "CS-550",
  "courseSection": "IN",
  "profName": [
   "Kuncak"
  ],
  "courseDesc": "We introduce formal verification as an approach for developing highly reliable systems. Formal verification finds proofs that computer systems work under all relevant scenarios. We will learn how to use formal verification tools and explain the theory and the practice behind them."
 },
 {
  "courseName": "Foundations and tools for processing tree structured data",
  "courseCode": "CS-525",
  "courseSection": "IN",
  "profName": [
   "Vanoirbeek"
  ],
  "courseDesc": "The course is about the foundations and tools for processing tree structured data, a prevalent model for\nrepresenting semi-structured data (SSD) over distributed information networks.\nIt aims at presenting approaches, programming languages and tools for modeling and manipulating tree-structured\ninfo"
 },
 {
  "courseName": "Graph theory",
  "courseCode": "MATH-360",
  "courseSection": "MA",
  "profName": [
   "Eisenbrand"
  ],
  "courseDesc": "The course aims to introduce the basic concepts and results of modern Graph Theory with special emphasis on those topics and techniques that have proved to be applicable in theoretical computer science and in practice during the past forty years."
 },
 {
  "courseName": "Human computer interaction",
  "courseCode": "CS-486",
  "courseSection": "IN",
  "profName": [
   "Pu Faltings"
  ],
  "courseDesc": "This course focuses on goal-directed design and interaction design, two subjects treated in depth in the Cooper book (see reference below). To practice these two methods, we propose a design challenge, which is to be carried out by a team of three students."
 },
 {
  "courseName": "Image analysis and pattern recognition",
  "courseCode": "EE-451",
  "courseSection": "EL",
  "profName": [
   "Thiran"
  ],
  "courseDesc": "This course gives an introduction to the main methods of image analysis and pattern recognition."
 },
 {
  "courseName": "Information theory and coding",
  "courseCode": "COM-404",
  "courseSection": "SC",
  "profName": [
   "Telatar"
  ],
  "courseDesc": "The mathematical principles of communication that govern the compression and transmission of data and the design of efficient methods of doing so."
 },
 {
  "courseName": "Intelligent agents",
  "courseCode": "CS-430",
  "courseSection": "IN",
  "profName": [
   "Faltings"
  ],
  "courseDesc": "Software agents are widely used to control physical, economic and financial processes. The course presents practical methods for implementing software agents and multi-agent systems, supported by programming exercises, and the theoretical underpinnings including computational game theory."
 },
 {
  "courseName": "Introduction to natural language processing",
  "courseCode": "CS-431",
  "courseSection": "IN",
  "profName": [
   "Chappelier",
   "Rajman"
  ],
  "courseDesc": "The objective of this course is to present the main models, formalisms and algorithms necessary for the development of applications in the field of natural language information processing. The concepts introduced during the lectures will be applied during practical sessions."
 },
 {
  "courseName": "Lab in data science",
  "courseCode": "EE-490(h)",
  "courseSection": "SC",
  "profName": [
   "Bouillet",
   "Choirat",
   "Obozinski",
   "Roskar",
   "Sarni",
   "Verscheure"
  ],
  "courseDesc": "This hands-on course teaches the tools & methods used by data scientists, from researching solutions to scaling up prototypes to Spark clusters. It exposes the students to the entire data science pipeline, from data acquisition to extracting valuable insights applied to real-world problems."
 },
 {
  "courseName": "Learning theory",
  "courseCode": "CS-526",
  "courseSection": "IN",
  "profName": [
   "Macris",
   "Urbanke"
  ],
  "courseDesc": "Machine learning and data analysis are becoming increasingly central in many sciences and applications. This course concentrates on the theoretical underpinnings of machine learning."
 },
 {
  "courseName": "Linear models",
  "courseCode": "MATH-341",
  "courseSection": "MA",
  "profName": [
   "Panaretos"
  ],
  "courseDesc": "Regression modelling is a basic tool of statistics, because it describes how one variable may depend on another. The aim of this course is to familiarize students with the basis of regression modelling, and of some related topics."
 },
 {
  "courseName": "Markov chains and algorithmic applications",
  "courseCode": "COM-516",
  "courseSection": "SC",
  "profName": [
   "Lévêque",
   "Macris"
  ],
  "courseDesc": "The study of random walks finds many applications in computer science and communications. The goal of the course is to get familiar with the theory of random walks, and to get an overview of some applications of this theory to problems of interest in communications, computer and network science."
 },
 {
  "courseName": "Mathematical foundations of signal processing",
  "courseCode": "COM-514",
  "courseSection": "SC",
  "profName": [
   "Kolundzija",
   "Parhizkar",
   "Scholefield"
  ],
  "courseDesc": "Signal processing tools are presented from an intuitive geometric point of view which is at the heart of all modern signal processing techniques. Student will develop the mathematical depth and rigor needed for the study of advanced topics in signal processing."
 },
 {
  "courseName": "Mathematics of data: from theory to computation",
  "courseCode": "EE-556",
  "courseSection": "EL",
  "profName": [
   "Cevher"
  ],
  "courseDesc": "This course reviews recent advances in convex optimization and statistical analysis in the wake of Big Data. We provide an overview of the emerging convex formulations and their guarantees, describe scalable solution techniques, and illustrate the role of parallel and distributed computation."
 },
 {
  "courseName": "Networks out of control",
  "courseCode": "COM-512",
  "courseSection": "SC",
  "profName": [
   "Grossglauser",
   "Thiran"
  ],
  "courseDesc": "The goal of this class is to acquire mathematical tools and engineering insight about networks whose structure is random, as well as learning and control techniques applicable to such network data."
 },
 {
  "courseName": "Optional project in data science",
  "courseCode": "COM-508",
  "courseSection": "SC",
  "profName": [
   "Profs divers"
  ]
 },
 {
  "courseName": "Performance evaluation",
  "courseCode": "COM-503",
  "courseSection": "SC",
  "profName": [
   ""
  ],
  "courseDesc": "In this course you will learn the methods and techniques that are used to perform a good performance evaluation during a research or development project."
 },
 {
  "courseName": "Risk, rare events and extremes",
  "courseCode": "MATH-447",
  "courseSection": "MA",
  "profName": [
   "Davison"
  ],
  "courseDesc": "Modelling of rare events, such as stock market crashes, storms and catastrophic structural failures, is important. This course will describe the special models and methods that are relevant to such modelling, including the mathematical bases, statistical tools and applications."
 },
 {
  "courseName": "Robust and nonparametric statistics",
  "courseCode": "MATH-441",
  "courseSection": "MA",
  "profName": [
   "Morgenthaler"
  ],
  "courseDesc": "In the decades from 1930 to 1950, many rank-based statistics were introduced. These methods were received with much interest, because they worked under weak conditions. Starting in the late 1950, a theory of robustness was added. The course gives an overview of these two approaches to data analysis."
 },
 {
  "courseName": "Software security",
  "courseCode": "CS-412",
  "courseSection": "IN",
  "profName": [
   "Payer"
  ],
  "courseDesc": "This course focuses on software security fundamentals, secure coding guidelines and principles, and advanced software security concepts. Students learn to assess and understand threats, learn how to design and implement secure software systems, and get hands-on experience with security pitfalls."
 },
 {
  "courseName": "Statistical theory",
  "courseCode": "MATH-442",
  "courseSection": "MA",
  "profName": [
   "Koch"
  ],
  "courseDesc": "The course aims at developing certain key aspects of the theory of statistics, providing a common general framework for statistical methodology. While the main emphasis will be on the mathematical aspects of statistics, an effort will be made to balance rigor and intuition."
 },
 {
  "courseName": "Student seminar: security protocols and applications",
  "courseCode": "COM-506",
  "courseSection": "SC",
  "profName": [
   "Oechslin",
   "Vaudenay"
  ],
  "courseDesc": "This seminar introduces the participants to the current trends, problems, and methods in the area of communication security."
 },
 {
  "courseName": "Technology ventures in IC",
  "courseCode": "CS-410",
  "courseSection": "IN",
  "profName": [
   ""
  ],
  "courseDesc": "This hands-on class gives graduate students in IC interested in startups the opportunity to learn and put in practice the fundamental skills required to assess a technology concept in the context of a business opportunity.  This class is focused only on business opportunities where high-technology"
 },
 {
  "courseName": "Time series",
  "courseCode": "MATH-342",
  "courseSection": "MA",
  "profName": [
   "Olhede"
  ],
  "courseDesc": "A first course in statistical time series analysis and applications, including practical work."
 },
 {
  "courseName": "Topics in theoretical computer science",
  "courseCode": "CS-455",
  "courseSection": "IN",
  "profName": [
   "Kapralov"
  ],
  "courseDesc": "The students gain an in-depth knowledge of several current and emerging areas of theoretical computer science. The course familiarizes them with advanced techniques, and develops an understanding of fundamental questions that underlie some of the key problems of modern computer science."
 },
 {
  "courseName": "Virtual reality",
  "courseCode": "CS-444",
  "courseSection": "IN",
  "profName": [
   "Boulic"
  ],
  "courseDesc": "The goal of VR is to embed the users in a potentially complex virtual environment while ensuring that they are able to react as if this environment were real. The course provides a human perception-action background and describes the key techniques for achieving efficient VR applications."
 },
 {
  "courseName": "Projet de semestre en data science",
  "courseCode": "COM-412",
  "courseSection": "SC",
  "profName": [
   "Profs divers"
  ]
 },
 {
  "courseName": "HSS : Introduction to project",
  "courseCode": "",
  "courseSection": "SHS",
  "profName": [
   "Divers enseignants"
  ]
 },
 {
  "courseName": "HSS : Project",
  "courseCode": "",
  "courseSection": "SHS",
  "profName": [
   "Divers enseignants"
  ]
 }
]