[
 {
  "courseName": "Engineering internship credited with master project (master in Microengineering)",
  "courseCode": "MICRO-597",
  "courseSection": "MT",
  "profName": [
   "Delacrétaz",
   "Gautsch"
  ],
  "courseDesc": ""
 },
 {
  "courseName": "Applied machine learning",
  "courseCode": "MICRO-455",
  "courseSection": "MT",
  "profName": [
   "Billard"
  ],
  "courseDesc": "Real-world engineering applications must cope with a large dataset of dynamic variables, which cannot be well approximated by classical or deterministic models. This course gives an overview of methods from Machine Learning for the analysis of non-linear, highly noisy and multi dimensional data"
 },
 {
  "courseName": "Basics of mobile robotics",
  "courseCode": "MICRO-452",
  "courseSection": "MT",
  "profName": [
   "Mondada"
  ],
  "courseDesc": "The course teaches the basics of autonomous mobile robots. Both hardware (energy, locomotion, sensors) and software (signal processing, control, localization, trajectory planning, high-level control) will be tackled. The students will apply the knowledge to program and control a real mobile robot."
 },
 {
  "courseName": "Model predictive control",
  "courseCode": "ME-425",
  "courseSection": "GM",
  "profName": [
   "Jones"
  ],
  "courseDesc": "Provide an introduction to the theory and practice of Model Predictive Control (MPC). Main benefits of MPC: flexible specification of time-domain objectives, performance optimization of highly complex multivariable systems and ability to explicitly enforce constraints on system behavior."
 },
 {
  "courseName": "Robotics practicals",
  "courseCode": "MICRO-453",
  "courseSection": "MT",
  "profName": [
   "Billard",
   "Floreano",
   "Mondada"
  ],
  "courseDesc": "The goal of this lab series is to practice the various theoretical frameworks acquired in the courses on a variety of robots, ranging from industrial robots to autonomous mobile robots, to robotic devices, all the way to interactive robots."
 },
 {
  "courseName": "Robotics project I",
  "courseCode": "MICRO-580",
  "courseSection": "MT",
  "profName": [
   "Profs divers"
  ]
 },
 {
  "courseName": "HSS : Introduction to project",
  "courseCode": "",
  "courseSection": "SHS",
  "profName": [
   "Divers enseignants"
  ]
 },
 {
  "courseName": "HSS : Project",
  "courseCode": "",
  "courseSection": "SHS",
  "profName": [
   "Divers enseignants"
  ]
 },
 {
  "courseName": "Advanced control systems",
  "courseCode": "ME-524",
  "courseSection": "GM",
  "profName": [
   "Karimi"
  ],
  "courseDesc": "This course covers some theoretical and practical aspects of robust and adaptive control. This includes H-2 and H-infinity control in model-based and data-driven framework by convex optimization, direct, indirect and switching adaptive control. The methods are implemented in a hands-on lab."
 },
 {
  "courseName": "Advanced machine learning",
  "courseCode": "MICRO-570",
  "courseSection": "MT",
  "profName": [
   "Billard"
  ],
  "courseDesc": "This course will present some of the core advanced methods in the field for structure discovery, classification and non-linear regression. This is an advanced class in Machine Learning; hence, students are expected to have some background in the field."
 },
 {
  "courseName": "Advanced MEMS & microsystems",
  "courseCode": "MICRO-534",
  "courseSection": "MT",
  "profName": [
   "Briand",
   "Quack"
  ],
  "courseDesc": "In depth analysis of the operation principles and technology of advanced micro- and nanosystems. Familiarisation to their implementation into products and their applications."
 },
 {
  "courseName": "Advanced satellite positioning",
  "courseCode": "ENV-542",
  "courseSection": "SIE",
  "profName": [
   "Botteron",
   "Skaloud"
  ],
  "courseDesc": "All  fundamental principles behind modern satellite positioning to acquire,  track and evaluate direct and indirect satellite signals and process them in relation to example applications: Earth monitoring (landslides,...), high precision positioning (automated driving, robots,...) and time transfer."
 },
 {
  "courseName": "Aerial robotics",
  "courseCode": "MICRO-502",
  "courseSection": "MT",
  "profName": [
   "Floreano"
  ],
  "courseDesc": "Aerial robotics\nMICRO-502    Lecturer(s) : Floreano DarioLanguage:English\nWithdrawal    \nIt is not allowed to withdraw from this subject after the registration deadline.    \nSummary"
 },
 {
  "courseName": "Analysis and modelling of locomotion",
  "courseCode": "BIOENG-404",
  "courseSection": "SV",
  "profName": [
   "Aminian",
   "Courtine",
   "Ijspeert"
  ],
  "courseDesc": "The lecture presents an overview of the state of the art in the analysis and modeling of human locomotion and the underlying motor circuits. Multiple aspects are considered including neurophysiology, gait characterization, biomechanics, numerical modeling, neuroprosthetics, and links to biped robots"
 },
 {
  "courseName": "Biomaterials",
  "courseCode": "BIOENG-442",
  "courseSection": "SV",
  "profName": [
   "Ghezzi",
   "Lütolf"
  ],
  "courseDesc": "This course covers the fundamental concepts behind the design, function and application of state-of-the-art biomaterials, that is, materials that are designed based on a molecular understanding of their interactions with biological systems."
 },
 {
  "courseName": "Computational motor control",
  "courseCode": "CS-432",
  "courseSection": "SV",
  "profName": [
   "Ijspeert"
  ],
  "courseDesc": "The course gives (1) a review of different types of numerical models of control of locomotion and movement in animals, (2) a presentation of different techniques for designing models, and (3) an analysis of the use and testing of those models in robotics and neuroprosthetics."
 },
 {
  "courseName": "Computer vision",
  "courseCode": "CS-442",
  "courseSection": "IN",
  "profName": [
   "Fua"
  ],
  "courseDesc": "Computer Vision aims at modeling the world from digital images acquired using video or infrared cameras, and other imaging sensors.\n\nWe will focus on images acquired using digital cameras. We will introduce basic processing techniques and discuss their field of applicability."
 },
 {
  "courseName": "Conceptual design of products and systems",
  "courseCode": "MICRO-443",
  "courseSection": "MT",
  "profName": [
   "Kejik"
  ],
  "courseDesc": ""
 },
 {
  "courseName": "Continuous improvement of manufacturing systems",
  "courseCode": "ME-498",
  "courseSection": "GM",
  "profName": [
   "Kaboli"
  ],
  "courseDesc": "Continuous improvement deals with ongoing and long-term initiatives to improve products and services. This course will arm students with practical skills to evaluate and improve manufacturing/service systems and lead change and drive transformation for people, processes, and technology."
 },
 {
  "courseName": "Controlling behavior in animals and robots",
  "courseCode": "BIOENG-456",
  "courseSection": "SV",
  "profName": [
   "Ramdya"
  ],
  "courseDesc": "Students will acquire an integrative view on biological and artificial algorithms for controlling autonomous behaviors in animals and robots. Students will synthesize and apply this knowledge in oral presentations and exercises."
 },
 {
  "courseName": "Deep learning",
  "courseCode": "EE-559",
  "courseSection": "EL",
  "profName": [
   "Fleuret"
  ],
  "courseDesc": "The objective of this course is to provide a complete introduction to deep machine learning. How to design a neural network, how to train it, and what are the modern techniques that specifically handle very large networks."
 },
 {
  "courseName": "Distributed intelligent systems",
  "courseCode": "ENG-466",
  "courseSection": "SIE",
  "profName": [
   "Martinoli"
  ],
  "courseDesc": "The goal of this course is to provide methods and tools for modeling distributed intelligent systems as well as designing and optimizing coordination strategies. The course is a well-balanced mixture of theory and practical activities using simulation and real hardware platforms."
 },
 {
  "courseName": "Embedded motor control",
  "courseCode": "MICRO-510",
  "courseSection": "MT",
  "profName": [
   "Hodder",
   "Köchli",
   "Perriard"
  ],
  "courseDesc": ""
 },
 {
  "courseName": "Embedded systems",
  "courseCode": "CS-473",
  "courseSection": "IN",
  "profName": [
   "Beuchat"
  ],
  "courseDesc": "The main topics of this course are understanding and designing embedded system on a programmable circuit (FPGA). Students will be able to design a camera or a LCD controller on an FPGA in VHDL and will use their controller through a softcore processor."
 },
 {
  "courseName": "Evolutionary robotics",
  "courseCode": "MICRO-515",
  "courseSection": "MT",
  "profName": [
   ""
  ],
  "courseDesc": "NOT OFFERED IN 2019-2020\nThe course describes theories, methods, and technologies for designing software and hardware systems that are inspired upon natural evolution. It also shows how artificial systems can help to understand biological systems."
 },
 {
  "courseName": "Flexible bioelectronics",
  "courseCode": "MICRO-514",
  "courseSection": "MT",
  "profName": [
   "Lacour"
  ],
  "courseDesc": "The course is an introduction to the emerging field of flexible (bio)electronics. It provides an overview of the materials and processes used to design and manufacture flexible circuits and sensors.  Applications encompass flexible sensors, biointerfaces, human-machine interfaces and neuroprosthetic"
 },
 {
  "courseName": "Fundamentals of computer aided manufacturing",
  "courseCode": "ME-416",
  "courseSection": "GM",
  "profName": [
   "Kyritsis"
  ],
  "courseDesc": "Students will be exposed to basic computer-aided manufacturing (CAM) modeling concepts, basic mathematical simulation, verification and optimization algorithms and methodologies and their applications. The students will practice their knowledge by doing projects with modern CAM software."
 },
 {
  "courseName": "Fundamentals of neuroengineering",
  "courseCode": "BIOENG-448",
  "courseSection": "SV",
  "profName": [
   ""
  ],
  "courseDesc": "Neuroengineering is at the frontier between neuroscience and engineering: understanding how the brain works allows developing engineering applications and therapies of high impact, while design of new measurement and data analysis techniques contributes to advance our knowledge about the brain."
 },
 {
  "courseName": "Haptic human robot interfaces",
  "courseCode": "MICRO-553",
  "courseSection": "MT",
  "profName": [
   "Bouri"
  ],
  "courseDesc": "This course teaches basic knowledge on haptic devices, force feedback and mechanical man-machine interfaces. Lectures are about 40 %, the rest is hands-on practical work with the \"haptic paddle\", a complete mechanical device with full laptop control interface. Realization of project in groups of 2."
 },
 {
  "courseName": "Image analysis and pattern recognition",
  "courseCode": "EE-451",
  "courseSection": "EL",
  "profName": [
   "Thiran"
  ],
  "courseDesc": "This course gives an introduction to the main methods of image analysis and pattern recognition."
 },
 {
  "courseName": "Image processing I",
  "courseCode": "MICRO-511",
  "courseSection": "MT",
  "profName": [
   "Unser",
   "Van De Ville"
  ],
  "courseDesc": "Introduction to the basic techniques of image processing. Introduction to the development of image-processing software and to prototyping in JAVA. Application to real-world examples in industrial vision and biomedical imaging."
 },
 {
  "courseName": "Image processing II",
  "courseCode": "MICRO-512",
  "courseSection": "MT",
  "profName": [
   "Liebling",
   "Sage",
   "Unser",
   "Van De Ville"
  ],
  "courseDesc": "Study of advanced image processing; mathematical imaging. Development of image-processing software and prototyping in JAVA; application to real-world examples in industrial vision and biomedical imaging."
 },
 {
  "courseName": "Industrial and applied robotics",
  "courseCode": "MICRO-451",
  "courseSection": "MT",
  "profName": [
   "Bouri"
  ],
  "courseDesc": ""
 },
 {
  "courseName": "Industrial automation",
  "courseCode": "CS-487",
  "courseSection": "SC",
  "profName": [
   "Pignolet-Oswald",
   "Tournier"
  ],
  "courseDesc": "This course consists of two parts:\n1) architecture of automation systems, hands-on lab\n2) handling of faults and failures in real-time systems, including fault-tolerant computing"
 },
 {
  "courseName": "Industry dynamics, models & trends",
  "courseCode": "MGT-453",
  "courseSection": "MTE",
  "profName": [
   "Finger"
  ],
  "courseDesc": "The course introduces the participants to industry analysis. Participants will learn how to identify and analyze industries with a particular focus on how industries evolve thanks to technological developments, in particular digitalization, as well as regulation."
 },
 {
  "courseName": "Integrated mechanical design",
  "courseCode": "ME-418",
  "courseSection": "GM",
  "profName": [
   ""
  ],
  "courseDesc": ""
 },
 {
  "courseName": "Intelligent agents",
  "courseCode": "CS-430",
  "courseSection": "IN",
  "profName": [
   "Faltings"
  ],
  "courseDesc": "Software agents are widely used to control physical, economic and financial processes. The course presents practical methods for implementing software agents and multi-agent systems, supported by programming exercises, and the theoretical underpinnings including computational game theory."
 },
 {
  "courseName": "Interdisciplinary project",
  "courseCode": "MICRO-582",
  "courseSection": "MT",
  "profName": [
   "Profs divers"
  ]
 },
 {
  "courseName": "Legged robots",
  "courseCode": "MICRO-507",
  "courseSection": "MT",
  "profName": [
   "Ijspeert"
  ],
  "courseDesc": "The course presents the design, control, and applications of legged robots. It gives a review of different types of legged robots (including two-, four- and multi-legged robots), and an in-depth analysis of different control methods for legged locomotion."
 },
 {
  "courseName": "Lifecycle performance of product systems",
  "courseCode": "ME-516",
  "courseSection": "GM",
  "profName": [
   "Friot",
   "Kyritsis"
  ],
  "courseDesc": "Provide the conceptual, scientific, technical and methodological understanding of measuring and evaluating the impact of engineering decisions on economic and environmental performance in the lifecycle of a product-system."
 },
 {
  "courseName": "Machine learning programming",
  "courseCode": "MICRO-401",
  "courseSection": "MT",
  "profName": [
   "Billard"
  ],
  "courseDesc": "This is a practice-based course, where students program algorithms in machine learning and evaluate the performance of the algorithm thoroughly using real-world dataset."
 },
 {
  "courseName": "Mecatronics",
  "courseCode": "ME-424",
  "courseSection": "GM",
  "profName": [
   "Agbeviade"
  ],
  "courseDesc": ""
 },
 {
  "courseName": "Mechanical product design and development",
  "courseCode": "ME-410",
  "courseSection": "GM",
  "profName": [
   ""
  ],
  "courseDesc": "Study and explore design principles of the different mechatronic components and systems. We will cover in-depth especially on meso-scale actuators, sensors and body construction methods."
 },
 {
  "courseName": "Multi-body simulation",
  "courseCode": "ME-475",
  "courseSection": "GM",
  "profName": [
   ""
  ],
  "courseDesc": "The objective of this course is to introduce to the student the basic concepts, models, algorithms and methods for the kinematic and dynamic analysis of multi-body systems, specifically designed for mobility."
 },
 {
  "courseName": "Multivariable control and coordination systems",
  "courseCode": "EE-477",
  "courseSection": "EL",
  "profName": [
   "Gillet"
  ],
  "courseDesc": "The objective is to enable students to design advanced digital solutions for the control and the coordination of distributed dynamic systems, such as production or distribution energy systems, as well as intelligent transportation systems."
 },
 {
  "courseName": "Networked control systems",
  "courseCode": "ME-427",
  "courseSection": "GM",
  "profName": [
   "Ferrari Trecate"
  ],
  "courseDesc": "This course offers an introduction to control systems using communication networks for interfacing sensors, actuators, controllers, and processes. Challenges due to network non-idealities and opportunities offered by communication will be analyzed."
 },
 {
  "courseName": "Numerical methods in biomechanics",
  "courseCode": "ME-484",
  "courseSection": "GM",
  "profName": [
   "Terrier"
  ],
  "courseDesc": "Students understand and apply numerical methods (FEM) to answer a research question in biomechanics. They know how to develop, verify and validate multi-physics and multi-scale numerical models. They can analyse and comment results in an oral presentation and a written report."
 },
 {
  "courseName": "Optimal decision making",
  "courseCode": "MGT-483",
  "courseSection": "MTE",
  "profName": [
   "Kuhn"
  ],
  "courseDesc": "This course introduces the theory and applications of optimization. We develop tools and concepts of optimization and decision analysis that enable managers in manufacturing, service operations, marketing, transportation and finance to transform data into insights for making better decisions."
 },
 {
  "courseName": "Organic and printed electronics",
  "courseCode": "MICRO-505",
  "courseSection": "MT",
  "profName": [
   "Briand",
   "Marjanovic",
   "Subramanian"
  ],
  "courseDesc": "This course addresses the implementation of organic and printed electronics technologies using large area manufacturing techniques. It will provide knowledge on materials, printing techniques, devices, systems, and applications: state of the art and current status on commercialization."
 },
 {
  "courseName": "Production management",
  "courseCode": "ME-419",
  "courseSection": "GM",
  "profName": [
   "Kaboli"
  ],
  "courseDesc": "Production management deals with producing goods/services at the right time, quantity, and quality with the minimum cost. This course will arm students with hands-on tools for demand management, supply management, and digital transformation in manufacturing companies."
 },
 {
  "courseName": "Real-time embedded systems",
  "courseCode": "CS-476",
  "courseSection": "IN",
  "profName": [
   "Beuchat"
  ],
  "courseDesc": "A real time system is subject to important temporal constraints. This course is about understanding where processing time is spent and what a designer can do in order to achieve real-time processing systems. Some solutions are Multiprocessors, accelerators, custom instructions, specialized hardware."
 },
 {
  "courseName": "Robotics project II",
  "courseCode": "MICRO-581",
  "courseSection": "MT",
  "profName": [
   "Profs divers"
  ]
 },
 {
  "courseName": "Sensorimotor neuroprosthetics",
  "courseCode": "BIOENG-486",
  "courseSection": "SV",
  "profName": [
   "Courtine",
   "Micera"
  ],
  "courseDesc": "Teaching objectives: history, neural control of movement, computational motor control, neurorehabilitation after CNS disorders, upper limb and hand neuroprostheses, lower limp neuroprostheses, student project."
 },
 {
  "courseName": "Sensor orientation",
  "courseCode": "ENV-548",
  "courseSection": "SIE",
  "profName": [
   "Skaloud"
  ],
  "courseDesc": "Determination of spatial orientation (i.e. position, velocity, attitude) via integration of inertial sensors with satellite positioning. Prerequisite for many applications related to remote sensing, environmental monitoring, mobile mapping, robotics, space exploration, smart-phone navigation, etc."
 },
 {
  "courseName": "Sensors in medical instrumentation",
  "courseCode": "EE-511",
  "courseSection": "EL",
  "profName": [
   "Aminian"
  ],
  "courseDesc": "Fundamental principles and methods used for physiological signal conditioning. Resistive, capacitive, inductive, piezoelectric and optical techniques used to detect and convert physiological information's to electrical signals. Laboratory and ambulatory devices for monitoring and therapy."
 },
 {
  "courseName": "Signal processing for functional brain imaging",
  "courseCode": "MICRO-513",
  "courseSection": "MT",
  "profName": [
   "Van De Ville"
  ],
  "courseDesc": "Computational methods for the analysis of human brain imaging data"
 },
 {
  "courseName": "System identification",
  "courseCode": "ME-421",
  "courseSection": "GM",
  "profName": [
   "Karimi"
  ],
  "courseDesc": "Identification of discrete-time linear models using experimental data is studied. The correlation method and spectral analysis are used to identify nonparametric models and the subspace and prediction error methods to estimate the plant and noise model parameters. Hands-on labs are included."
 }
]